In [5]:
import pandas as pd
import numpy as np

### Series.

In [4]:
s1 = pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
arr = np.array([10,20,30,40])
arr

array([10, 20, 30, 40])

In [10]:
adm = pd.Series([78,45,90,110],index = ["mech","IT","E&tc","Civil"])
adm

mech      78
IT        45
E&tc      90
Civil    110
dtype: int64

In [15]:
marks = pd.Series({"Prathmesh":87,"Anagha":84,"Prem":65})
marks

Prathmesh    87
Anagha       84
Prem         65
dtype: int64

In [16]:
s2 = pd.Series([10,"python",45.78,(10,22)])
s2

0          10
1      python
2       45.78
3    (10, 22)
dtype: object

In [18]:
type(s2[2])

float

In [19]:
adm["IT"]

45

In [20]:
adm["AI"]=89

In [ ]:
adm

mech      78
IT        45
E&tc      90
Civil    110
AI        89
dtype: int64

In [23]:
s1 = pd.Series([ 1,2,3,4])
s2 = pd.Series([ 1,2,3,4])
s1 + s2

0    2
1    4
2    6
3    8
dtype: int64

In [24]:
s1 = pd.Series([ 1,2,3,4],index= ['A','B','C','D'])
s2 = pd.Series([ 1,2,3,4],index = ['C','A','X','F'])
s1+s2

A    3.0
B    NaN
C    4.0
D    NaN
F    NaN
X    NaN
dtype: float64

# Indexing & SLicing

In [26]:
p = pd.Series(np.arange(45,56))
p

0     45
1     46
2     47
3     48
4     49
5     50
6     51
7     52
8     53
9     54
10    55
dtype: int32

In [27]:
p[5:]

5     50
6     51
7     52
8     53
9     54
10    55
dtype: int32

In [28]:
adm.iloc[0:2]

mech    78
IT      45
dtype: int64

In [6]:
df = pd.DataFrame({"Marks" : [60,70,40 ],"Sallery" : [7800,8000,5000 ],"Name" : ["Prem","Prathmesh","Angha"] })
df

   Marks  Sallery       Name
0     60     7800       Prem
1     70     8000  Prathmesh
2     40     5000      Angha

In [7]:
df['Marks']

0    6000
1    7000
2    4000
Name: Marks, dtype: int64

In [11]:
df.iloc[0:2,1:]

   Sallery       Name
0     7800       Prem
1     8000  Prathmesh

In [30]:
df[df['Marks']>50][["Sallery",'Name','Marks']]

   Sallery       Name  Marks
0     7800       Prem     60
1     8000  Prathmesh     70

In [37]:

Employee = pd.DataFrame({'Eid': [10,11,12,13],"Sallery" : [8000,8000,5000,10000],"Name" : ["Prem","Prathmesh","Angha","Sam"],"Gender" : ['M','M','F','F'],'dno':[1,2,1,3],"Dept" :['It','sales','Mech',"admin"]})

In [10]:
Employee

   Eid  Sallery       Name Gender  dno   Dept
0   10     7800       Prem      M    1     It
1   11     8000  Prathmesh      M    2  sales
2   12     5000      Angha      F    1   Mech
3   13    10000        Sam      F    3  admin

In [34]:
Employee['Annual Sallery'] = Employee['Sallery']*12

In [35]:
Employee

   Eid  Sallery       Name Gender  dno  Annual Sallery
0   10     7800       Prem      M    1           93600
1   11     8000  Prathmesh      M    2           96000
2   12     5000      Angha      F    1           60000
3   13    10000        Sam      F    3          120000

In [36]:
Employee.drop('Annual Sallery',axis=1,inplace=True)

In [40]:
Employee.columns

Index(['Eid', 'Sallery', 'Name', 'Gender', 'dno'], dtype='object')

In [43]:
# Adding A Row
new_record = pd.DataFrame([[14,15000,'Aniket','M',2]],columns=['Eid', 'Sallery', 'Name', 'Gender', 'dno'])

In [44]:
Employee = pd.concat([Employee,new_record])

In [13]:
Employee

   Eid  Sallery       Name Gender  dno   Dept
0   10     7800       Prem      M    1     It
1   11     8000  Prathmesh      M    2  sales
2   12     5000      Angha      F    1   Mech
3   13    10000        Sam      F    3  admin

## Merge

Inner - we can get only Left and right Records

Left - we can get All record of Left DF and Matching from Right DF

Right - It takes all from right and matching from left

outer - all from right and aal from left

#####

In [14]:
pd.merge(Employee,Dept,how="inner",on=Dno)

NameError: name 'Dept' is not defined

# Grouping

In [15]:
Employee

   Eid  Sallery       Name Gender  dno   Dept
0   10     7800       Prem      M    1     It
1   11     8000  Prathmesh      M    2  sales
2   12     5000      Angha      F    1   Mech
3   13    10000        Sam      F    3  admin

In [20]:
Employee['Sallery'].sum()

30800

In [25]:
Employee.groupby('Sallery')

In [33]:
df2 = pd.DataFrame(Employee.groupby('Sallery'))
df2

       0                                                  1
0   5000     Eid  Sallery   Name Gender  dno  Dept
2   1...
1   7800     Eid  Sallery  Name Gender  dno Dept
0   10 ...
2   8000     Eid  Sallery       Name Gender  dno   Dept
...
3  10000     Eid  Sallery Name Gender  dno   Dept
3   13...

In [38]:
Employee.groupby('Sallery')['Sallery'].count()

Sallery
5000     1
8000     2
10000    1
Name: Sallery, dtype: int64

In [39]:
Employee['Sallery'].mean()

7750.0

In [41]:
Employee['Sallery'].mode()

0    8000
Name: Sallery, dtype: int64

In [42]:
Employee['Sallery'].min()

5000

In [43]:
Employee['Sallery'].median()

8000.0

In [44]:
Employee['Sallery'].max()

10000

In [45]:
Employee.groupby('dno')['dno'].count()

dno
1    2
2    1
3    1
Name: dno, dtype: int64

In [48]:
Employee.groupby('dno')['Sallery'].max()

dno
1     8000
2     8000
3    10000
Name: Sallery, dtype: int64

In [ ]:
Employee.d

## Handling missing Data

Em